In [2]:
import pandas as pd
print(pd.__version__)

2.2.3

In [4]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Country': ['USA', 'Canada', 'USA', 'UK']
})

df

      Name  Age Country
0    Alice   25     USA
1      Bob   30  Canada
2  Charlie   35     USA
3    David   40      UK

In [6]:
df['Age_Times_2'] = df['Age'].apply(lambda x: x * 2)
df

      Name  Age Country  Age_Times_2
0    Alice   25     USA           50
1      Bob   30  Canada           60
2  Charlie   35     USA           70
3    David   40      UK           80

In [8]:
df['Region'] = df['Country'].apply(lambda x: 'North America' if x in ['USA', 'Canada'] else 'Europe')
df

      Name  Age Country  Age_Times_2         Region
0    Alice   25     USA           50  North America
1      Bob   30  Canada           60  North America
2  Charlie   35     USA           70  North America
3    David   40      UK           80         Europe